step-by-step/030-populate-database/020-soap/1300-устройства/0100.xml

<?xml version="1.0" ?>
<!-- Создаем устройство -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:inetDeviceUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <inetDevice xmlns="" deviceGroupIds="" deviceTypeId="1" entityId="0" entitySpecId="0" id="-1" ident="VLAN per user, Q-in-Q"
                        orderManagerDisabled="false" parentId="0">
                <entityAttributes></entityAttributes>
                <comment></comment>
                <config></config>
                <host></host>
                <password></password>
                <secret></secret>
                <username></username>
<invConfig>
# Режим поиска сервиса на устройстве
#   2 - поиск по VLAN'у на устройстве
dhcp.servSearchMode=2

# Пулы IP-адресов
dhcp.ipCategories=1,2

# DHCP-опции в ответах
dhcp.option.serverIdentifier=192.168.99.254
dhcp.option.leaseTime=180
</invConfig>
                <invDeviceId>0</invDeviceId>
                <invDeviceTypeId>1</invDeviceTypeId>
                <invHost></invHost>
                <invIdentifier>VLAN per user, Q-in-Q</invIdentifier>
            </inetDevice>
            <updateInvDevice xmlns="">true</updateInvDevice>
        </ns5:inetDeviceUpdate>
    </S:Body>
</S:Envelope
>